perf/load/bboxa.yaml
config:
  environments:
    node:
      target: "http://localhost:5555/app"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    replicated:
      target: "http://localhost:5555/replicated"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  # Spike load test
  phases:
    - name: init
      duration: 10
      arrivalRate: 4
    - name: rampTo
      duration: 90
      arrivalRate: 12
      rampTo: 120
    - name: postRampTo
      duration: 60
      arrivalRate: 120
    - name: finish
      duration: 30
      arrivalRate: 0

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: "/bbox/a"